In [ ]:
# Pandas : DataFrame

In [1]:
import pandas as pd
import numpy as np

In [2]:
score = [[12, 20, 18], [13, 14, 6], [12, 8, 19], [20, 16, 9]]

In [3]:
df = pd.DataFrame(data=score)
df

    0   1   2
0  12  20  18
1  13  14   6
2  12   8  19
3  20  16   9

In [4]:
dars = ['Python', 'C++', 'Java']
name = ['Ali', 'Sara', 'Taha', 'Mahsa']

In [5]:
df = pd.DataFrame(data=score, index=name, columns=dars)
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     6
Taha       12    8    19
Mahsa      20   16     9

In [6]:
d = {'Python': [12, 13, 12, 20], 'C++': [20, 14, 8, 16], 'Java': [18, 6, 19, 9] }
student = pd.DataFrame(data=d, index=name)
student

       Python  C++  Java
Ali        12   20    18
Sara       13   14     6
Taha       12    8    19
Mahsa      20   16     9

In [7]:
df.values

array([[12, 20, 18],
       [13, 14,  6],
       [12,  8, 19],
       [20, 16,  9]], dtype=int64)

In [8]:
df.columns

Index(['Python', 'C++', 'Java'], dtype='object')

In [9]:
'Java' in df.columns

True

In [10]:
df.index

Index(['Ali', 'Sara', 'Taha', 'Mahsa'], dtype='object')

In [11]:
'Sara' in df.index

True

In [12]:
df.axes

[Index(['Ali', 'Sara', 'Taha', 'Mahsa'], dtype='object'),
 Index(['Python', 'C++', 'Java'], dtype='object')]

In [13]:
df.dtypes

Python    int64
C++       int64
Java      int64
dtype: object

In [14]:
### Indexing, Selection, and Filtering

In [15]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     6
Taha       12    8    19
Mahsa      20   16     9

In [16]:
df['C++']

Ali      20
Sara     14
Taha      8
Mahsa    16
Name: C++, dtype: int64

In [17]:
df[['Python', 'Java']]

       Python  Java
Ali        12    18
Sara       13     6
Taha       12    19
Mahsa      20     9

In [18]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     6
Taha       12    8    19
Mahsa      20   16     9

In [19]:
df[:3]

      Python  C++  Java
Ali       12   20    18
Sara      13   14     6
Taha      12    8    19

In [20]:
df < 10

       Python    C++   Java
Ali     False  False  False
Sara    False  False   True
Taha    False   True  False
Mahsa   False  False   True

In [21]:
df[df < 10] = 0
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [22]:
df[df['C++'] > 10]

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Mahsa      20   16     0

In [23]:
# loc , iloc

In [24]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [25]:
df.loc['Taha']

Python    12
C++        0
Java      19
Name: Taha, dtype: int64

In [26]:
df.iloc[2]

Python    12
C++        0
Java      19
Name: Taha, dtype: int64

In [27]:
df.iloc[[2]]

      Python  C++  Java
Taha      12    0    19

In [28]:
df.loc['Taha', ['Python','Java']]

Python    12
Java      19
Name: Taha, dtype: int64

In [29]:
df.iloc[2, [0, 2]]

Python    12
Java      19
Name: Taha, dtype: int64

In [30]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [31]:
df.loc[:'Taha', 'Python']

Ali     12
Sara    13
Taha    12
Name: Python, dtype: int64

In [32]:
df.iloc[:3,0]

Ali     12
Sara    13
Taha    12
Name: Python, dtype: int64

In [33]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [34]:
df.iloc[:2, [0, 1]]

      Python  C++
Ali       12   20
Sara      13   14

In [35]:
df.iloc[0, 1]

20

In [36]:
df.iloc[[0, 2]]

      Python  C++  Java
Ali       12   20    18
Taha      12    0    19

In [37]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [38]:
df.iloc[[True, False, True, True]]

       Python  C++  Java
Ali        12   20    18
Taha       12    0    19
Mahsa      20   16     0

In [39]:
df.iloc[:, [True, False, True]]

       Python  Java
Ali        12    18
Sara       13     0
Taha       12    19
Mahsa      20     0

In [40]:
df.iloc[[True, False, True, True], [True, False, True]]

       Python  Java
Ali        12    18
Taha       12    19
Mahsa      20     0

In [41]:
# iat : Access a single value for a row/column pair by integer position.

In [42]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [43]:
df.iat[2, 1]

0

In [44]:
df.iat[0, 1]

20

### reindex

In [45]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [46]:
df.reindex(['Ali', 'Sara', 'Taha', 'Mahsa', 'Omid'], fill_value=0)

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0
Omid        0    0     0

In [47]:
df.reindex(columns=['Python', 'C++', 'Java', 'Pascal'], fill_value=0)

       Python  C++  Java  Pascal
Ali        12   20    18       0
Sara       13   14     0       0
Taha       12    0    19       0
Mahsa      20   16     0       0

In [48]:
### sort_values

In [49]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [50]:
df.sort_values(by='Python', ascending=False)

       Python  C++  Java
Mahsa      20   16     0
Sara       13   14     0
Ali        12   20    18
Taha       12    0    19

In [51]:
df.sort_values(by='Python')

       Python  C++  Java
Ali        12   20    18
Taha       12    0    19
Sara       13   14     0
Mahsa      20   16     0

In [52]:
df.sort_values(by=['Python', 'C++'])

       Python  C++  Java
Taha       12    0    19
Ali        12   20    18
Sara       13   14     0
Mahsa      20   16     0

In [53]:
### sort_index

In [54]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [55]:
df.sort_index()

       Python  C++  Java
Ali        12   20    18
Mahsa      20   16     0
Sara       13   14     0
Taha       12    0    19

In [56]:
df.sort_index(axis=1)

       C++  Java  Python
Ali     20    18      12
Sara    14     0      13
Taha     0    19      12
Mahsa   16     0      20

In [57]:
df.sort_index(axis=1, ascending=False)

       Python  Java  C++
Ali        12    18   20
Sara       13     0   14
Taha       12    19    0
Mahsa      20     0   16

### idxmax

In [58]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [59]:
df.idxmax()

Python    Mahsa
C++         Ali
Java       Taha
dtype: object

### sum() , mean() , describe()

In [60]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [61]:
df.sum()

Python    57
C++       50
Java      37
dtype: int64

In [62]:
df.mean()

Python    14.25
C++       12.50
Java       9.25
dtype: float64

In [63]:
df.sum(axis='columns')

Ali      50
Sara     27
Taha     31
Mahsa    36
dtype: int64

In [64]:
df.mean(axis='columns')

Ali      16.666667
Sara      9.000000
Taha     10.333333
Mahsa    12.000000
dtype: float64

In [65]:
df.mean(axis='columns', skipna=False)

Ali      16.666667
Sara      9.000000
Taha     10.333333
Mahsa    12.000000
dtype: float64

In [66]:
df.describe()

         Python        C++       Java
count   4.00000   4.000000   4.000000
mean   14.25000  12.500000   9.250000
std     3.86221   8.698659  10.688779
min    12.00000   0.000000   0.000000
25%    12.00000  10.500000   0.000000
50%    12.50000  15.000000   9.000000
75%    14.75000  17.000000  18.250000
max    20.00000  20.000000  19.000000

### Transpose

In [67]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [68]:
df.T

        Ali  Sara  Taha  Mahsa
Python   12    13    12     20
C++      20    14     0     16
Java     18     0    19      0

### apply

In [69]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [70]:
df.apply(lambda x: x-1)

       Python  C++  Java
Ali        11   19    17
Sara       12   13    -1
Taha       11   -1    18
Mahsa      19   15    -1

In [71]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [72]:
def myfunc(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

df.apply(myfunc)

     Python  C++  Java
min      12    0     0
max      20   20    19

In [73]:
### map

In [74]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [75]:
df['Python'].map(lambda x: x - 1)

Ali      11
Sara     12
Taha     11
Mahsa    19
Name: Python, dtype: int64

### applymap

In [76]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [77]:
df.applymap(lambda x: '%.4f' % x)

        Python      C++     Java
Ali    12.0000  20.0000  18.0000
Sara   13.0000  14.0000   0.0000
Taha   12.0000   0.0000  19.0000
Mahsa  20.0000  16.0000   0.0000

### drop

In [78]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [79]:
a = df.drop(['Java'], axis=1)

In [80]:
a

       Python  C++
Ali        12   20
Sara       13   14
Taha       12    0
Mahsa      20   16

In [81]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [82]:
df.drop(['Sara'])

       Python  C++  Java
Ali        12   20    18
Taha       12    0    19
Mahsa      20   16     0

In [83]:
df

       Python  C++  Java
Ali        12   20    18
Sara       13   14     0
Taha       12    0    19
Mahsa      20   16     0

In [84]:
df.drop(['Sara'], inplace=True)

In [85]:
df

       Python  C++  Java
Ali        12   20    18
Taha       12    0    19
Mahsa      20   16     0

### empty

In [86]:
df.empty

False

### Arithmetic methods with fill values

In [87]:
arr1 = np.arange(12).reshape((4, 3))
arr1

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [88]:
df1 = pd.DataFrame(data=arr1, columns=list('abc'))
df1

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [89]:
arr2 = np.arange(10).reshape((5, 2))
df2 = pd.DataFrame(data=arr2, columns=list('ab'))
df2

   a  b
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [90]:
df2.loc[1, 'b'] = np.nan
df2

   a    b
0  0  1.0
1  2  NaN
2  4  5.0
3  6  7.0
4  8  9.0

In [91]:
df1

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [92]:
df2

   a    b
0  0  1.0
1  2  NaN
2  4  5.0
3  6  7.0
4  8  9.0

In [93]:
df1 + df2

      a     b   c
0   0.0   2.0 NaN
1   5.0   NaN NaN
2  10.0  12.0 NaN
3  15.0  17.0 NaN
4   NaN   NaN NaN

In [94]:
df1.add(df2)

      a     b   c
0   0.0   2.0 NaN
1   5.0   NaN NaN
2  10.0  12.0 NaN
3  15.0  17.0 NaN
4   NaN   NaN NaN

In [95]:
df1.add(df2, fill_value=0)

      a     b     c
0   0.0   2.0   2.0
1   5.0   4.0   5.0
2  10.0  12.0   8.0
3  15.0  17.0  11.0
4   8.0   9.0   NaN

In [96]:
df1.sub(df2)

     a    b   c
0  0.0  0.0 NaN
1  1.0  NaN NaN
2  2.0  2.0 NaN
3  3.0  3.0 NaN
4  NaN  NaN NaN

In [97]:
df1

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [98]:
df1.cumsum()

    a   b   c
0   0   1   2
1   3   5   7
2   9  12  15
3  18  22  26

### index.name, columns.name

In [99]:
mydict = {'City':['Hamedan', 'Hamedan', 'Hamedan', 'Tehran', 'Tehran', 'Tehran'],
          'Year':[1396, 1397, 1398, 1397, 1398, 1399],
          'Pop': [2, 2.2, 3, 8, 8.5, 9]}

f = pd.DataFrame(data=mydict)
f

      City  Year  Pop
0  Hamedan  1396  2.0
1  Hamedan  1397  2.2
2  Hamedan  1398  3.0
3   Tehran  1397  8.0
4   Tehran  1398  8.5
5   Tehran  1399  9.0

In [100]:
d = {'Tehran': {1397: 8, 1398: 8.5, 1399: 9},'Hamedan': {1396: 2, 1397: 2.2, 1398: 3}}
frame = pd.DataFrame(data=d)
frame

      Tehran  Hamedan
1397     8.0      2.2
1398     8.5      3.0
1399     9.0      NaN
1396     NaN      2.0

In [101]:
frame.index.name = 'year'
frame

      Tehran  Hamedan
year
1397     8.0      2.2
1398     8.5      3.0
1399     9.0      NaN
1396     NaN      2.0

In [102]:
frame.columns.name = 'city'
frame

city  Tehran  Hamedan
year
1397     8.0      2.2
1398     8.5      3.0
1399     9.0      NaN
1396     NaN      2.0

### Operations between DataFrame and Series

In [103]:
frame

city  Tehran  Hamedan
year
1397     8.0      2.2
1398     8.5      3.0
1399     9.0      NaN
1396     NaN      2.0

In [104]:
myser = frame.iloc[1]
myser

city
Tehran     8.5
Hamedan    3.0
Name: 1398, dtype: float64

In [106]:
frame + myser

city  Tehran  Hamedan
year
1397    16.5      5.2
1398    17.0      6.0
1399    17.5      NaN
1396     NaN      5.0

## Hierarchical Indexing

In [107]:
frame = pd.DataFrame({'C++': [6, 7, 4, 16, 14, 13, 15, 7], 
                      'Python': [3, 2, 5, 14, 19, 18, 16, 10],
                      'K1': ['one', 'one', 'one', 'two', 'two', 'two', 'two', 'two'],
                      'K2': ['ali', 'reza', 'sara', 'ali', 'reza', 'sara', 'taha', 'farid']})
frame

   C++  Python   K1     K2
0    6       3  one    ali
1    7       2  one   reza
2    4       5  one   sara
3   16      14  two    ali
4   14      19  two   reza
5   13      18  two   sara
6   15      16  two   taha
7    7      10  two  farid

In [108]:
df = frame.set_index(['K1', 'K2'])
df

           C++  Python
K1  K2
one ali      6       3
    reza     7       2
    sara     4       5
two ali     16      14
    reza    14      19
    sara    13      18
    taha    15      16
    farid    7      10

In [109]:
df.sort_index(level=1)

           C++  Python
K1  K2
one ali      6       3
two ali     16      14
    farid    7      10
one reza     7       2
two reza    14      19
one sara     4       5
two sara    13      18
    taha    15      16

In [110]:
df.mean(level='K2')

        C++  Python
K2
ali    11.0     8.5
reza   10.5    10.5
sara    8.5    11.5
taha   15.0    16.0
farid   7.0    10.0

In [111]:
df

           C++  Python
K1  K2
one ali      6       3
    reza     7       2
    sara     4       5
two ali     16      14
    reza    14      19
    sara    13      18
    taha    15      16
    farid    7      10

In [112]:
df.unstack()

      C++                         Python
K2    ali farid  reza  sara  taha    ali farid  reza  sara  taha
K1
one   6.0   NaN   7.0   4.0   NaN    3.0   NaN   2.0   5.0   NaN
two  16.0   7.0  14.0  13.0  15.0   14.0  10.0  19.0  18.0  16.0

In [113]:
df

           C++  Python
K1  K2
one ali      6       3
    reza     7       2
    sara     4       5
two ali     16      14
    reza    14      19
    sara    13      18
    taha    15      16
    farid    7      10

In [114]:
df.swaplevel('K1', 'K2')

           C++  Python
K2    K1
ali   one    6       3
reza  one    7       2
sara  one    4       5
ali   two   16      14
reza  two   14      19
sara  two   13      18
taha  two   15      16
farid two    7      10

In [ ]:
##

In [115]:
d = np.arange(12).reshape((4, 3))
c = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
i = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]]

frame = pd.DataFrame(data=d,index=i, columns=c)
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [116]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11